Tekla.Structures.AssertTraceListener
TraceListener used for trapping assertion failures during unit tests.

Tekla.Structures.AssertTraceListener.#ctor
Initializes a new instance of the Tekla.Structures.AssertTraceListener class.

Tekla.Structures.AssertTraceListener.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.AssertTraceListener class.
name:
The name.

Tekla.Structures.AssertTraceListener.Fail(System.String,System.String)
The fail.
message:
The message.
detailMessage:
The detail message.

Tekla.Structures.AssertTraceListener.Fail(System.String)
The fail.
message:
The message.

Tekla.Structures.AssertTraceListener.GetAssertionMethodName
The get assertion method name.
Returns:
The System.String.